## Clusters Terraform Plan
  ```terraform
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                        # (6 unchanged elements hidden)
                        {
                            remoteRef = {
                                key      = "TF_VAR_VAULT_TOKEN"
                                property = "data.TF_VAR_VAULT_TOKEN"
                            }
                            secretKey = "TF_VAR_VAULT_TOKEN"
                        },
                      + {
                          + remoteRef = {
                              + key      = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                              + property = "data.EXTERNAL_DNS_PIHOLE_PASSWORD"
                            }
                          + secretKey = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                        # (6 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "TF_VAR_VAULT_TOKEN"
                                metadataPolicy     = "None"
                                property           = "data.TF_VAR_VAULT_TOKEN"
                                version            = null
                            }
                            secretKey = "TF_VAR_VAULT_TOKEN"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.EXTERNAL_DNS_PIHOLE_PASSWORD"
                              + version            = (known after apply)
                            }
                          + secretKey = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

  # module.externaldns[0].kubernetes_deployment.externaldns will be updated in-place
  ~ resource "kubernetes_deployment" "externaldns" {
        id               = "default/external-dns"
        # (1 unchanged attribute hidden)

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ spec {
                    # (18 unchanged attributes hidden)

                  ~ container {
                        name                       = "external-dns"
                        # (10 unchanged attributes hidden)

                      ~ env_from {
                            # (1 unchanged attribute hidden)

                          ~ secret_ref {
                              ~ name     = "pihole-password" -> "cluster-secrets"
                                # (1 unchanged attribute hidden)
                            }
                        }

                        # (1 unchanged block hidden)
                    }

                    # (1 unchanged block hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                        # (6 unchanged elements hidden)
                        {
                            remoteRef = {
                                key      = "TF_VAR_VAULT_TOKEN"
                                property = "data.TF_VAR_VAULT_TOKEN"
                            }
                            secretKey = "TF_VAR_VAULT_TOKEN"
                        },
                      + {
                          + remoteRef = {
                              + key      = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                              + property = "data.EXTERNAL_DNS_PIHOLE_PASSWORD"
                            }
                          + secretKey = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                        # (6 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "TF_VAR_VAULT_TOKEN"
                                metadataPolicy     = "None"
                                property           = "data.TF_VAR_VAULT_TOKEN"
                                version            = null
                            }
                            secretKey = "TF_VAR_VAULT_TOKEN"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.EXTERNAL_DNS_PIHOLE_PASSWORD"
                              + version            = (known after apply)
                            }
                          + secretKey = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

  # module.externaldns[0].kubernetes_deployment.externaldns will be updated in-place
  ~ resource "kubernetes_deployment" "externaldns" {
        id               = "default/external-dns"
        # (1 unchanged attribute hidden)

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ spec {
                    # (18 unchanged attributes hidden)

                  ~ container {
                        name                       = "external-dns"
                        # (10 unchanged attributes hidden)

                      ~ env_from {
                            # (1 unchanged attribute hidden)

                          ~ secret_ref {
                              ~ name     = "pihole-password" -> "cluster-secrets"
                                # (1 unchanged attribute hidden)
                            }
                        }

                        # (1 unchanged block hidden)
                    }

                    # (1 unchanged block hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                        # (6 unchanged elements hidden)
                        {
                            remoteRef = {
                                key      = "TF_VAR_VAULT_TOKEN"
                                property = "data.TF_VAR_VAULT_TOKEN"
                            }
                            secretKey = "TF_VAR_VAULT_TOKEN"
                        },
                      + {
                          + remoteRef = {
                              + key      = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                              + property = "data.EXTERNAL_DNS_PIHOLE_PASSWORD"
                            }
                          + secretKey = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                        # (6 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "TF_VAR_VAULT_TOKEN"
                                metadataPolicy     = "None"
                                property           = "data.TF_VAR_VAULT_TOKEN"
                                version            = null
                            }
                            secretKey = "TF_VAR_VAULT_TOKEN"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.EXTERNAL_DNS_PIHOLE_PASSWORD"
                              + version            = (known after apply)
                            }
                          + secretKey = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

  # module.externaldns[0].kubernetes_deployment.externaldns will be updated in-place
  ~ resource "kubernetes_deployment" "externaldns" {
        id               = "default/external-dns"
        # (1 unchanged attribute hidden)

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ spec {
                    # (18 unchanged attributes hidden)

                  ~ container {
                        name                       = "external-dns"
                        # (10 unchanged attributes hidden)

                      ~ env_from {
                            # (1 unchanged attribute hidden)

                          ~ secret_ref {
                              ~ name     = "pihole-password" -> "cluster-secrets"
                                # (1 unchanged attribute hidden)
                            }
                        }

                        # (1 unchanged block hidden)
                    }

                    # (1 unchanged block hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.externaldns[0].kubernetes_deployment.externaldns will be updated in-place
  ~ resource "kubernetes_deployment" "externaldns" {
        id               = "default/external-dns"
        # (1 unchanged attribute hidden)

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ spec {
                    # (18 unchanged attributes hidden)

                  ~ container {
                        name                       = "external-dns"
                        # (10 unchanged attributes hidden)

                      ~ env_from {
                            # (1 unchanged attribute hidden)

                          ~ secret_ref {
                              ~ name     = "pihole-password" -> "cluster-secrets"
                                # (1 unchanged attribute hidden)
                            }
                        }

                        # (1 unchanged block hidden)
                    }

                    # (1 unchanged block hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cert_manager[0].helm_release.cert_manager is tainted, so must be replaced
-/+ resource "helm_release" "cert_manager" {
      ~ id                         = "cert-manager" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "v1.16.2"
              - chart          = "cert-manager"
              - first_deployed = 1742145890
              - last_deployed  = 1742145890
              - name           = "cert-manager"
              - namespace      = "cert-manager"
              - notes          = <<-EOT
                    cert-manager v1.16.2 has been deployed successfully!
                    
                    In order to begin issuing certificates, you will need to set up a ClusterIssuer
                    or Issuer resource (for example, by creating a 'letsencrypt-staging' issuer).
                    
                    More information on the different types of issuers and how to configure them
                    can be found in our documentation:
                    
                    https://cert-manager.io/docs/configuration/
                    
                    For information on how to configure cert-manager to automatically provision
                    Certificates for Ingress resources, take a look at the `ingress-shim`
                    documentation:
                    
                    https://cert-manager.io/docs/usage/ingress/
                EOT
              - revision       = 1
              - values         = jsonencode({})
              - version        = "v1.16.2"
            },
        ] -> (known after apply)
        name                       = "cert-manager"
      ~ status                     = "failed" -> "deployed"
        # (25 unchanged attributes hidden)
    }

  # module.externaldns[0].kubernetes_deployment.externaldns is tainted, so must be replaced
-/+ resource "kubernetes_deployment" "externaldns" {
      ~ id               = "default/external-dns" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
          - labels           = {} -> null
            name             = "external-dns"
          ~ resource_version = "1784" -> (known after apply)
          ~ uid              = "07d6859a-26ae-4b05-be7c-eeaa64d76673" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ strategy (known after apply)
          - strategy {
              - type = "RollingUpdate" -> null

              - rolling_update {
                  - max_surge       = "25%" -> null
                  - max_unavailable = "25%" -> null
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                    # (3 unchanged attributes hidden)
                }
              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  ~ scheduler_name                   = "default-scheduler" -> (known after apply)
                    # (13 unchanged attributes hidden)

                  ~ container {
                      - command                    = [] -> null
                      ~ image_pull_policy          = "IfNotPresent" -> (known after apply)
                        name                       = "external-dns"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (7 unchanged attributes hidden)

                      ~ env_from {
                            # (1 unchanged attribute hidden)

                          ~ secret_ref {
                              ~ name     = "pihole-password" -> "cluster-secrets"
                                # (1 unchanged attribute hidden)
                            }
                        }

                      ~ resources (known after apply)
                      - resources {
                          - limits   = {} -> null
                          - requests = {} -> null
                        }
                    }

                  ~ image_pull_secrets (known after apply)

                  ~ readiness_gate (known after apply)

                  ~ security_context {
                      - supplemental_groups    = [] -> null
                        # (5 unchanged attributes hidden)
                    }
                }
            }

            # (1 unchanged block hidden)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

  ```
  
  Plan exit code: 0
  